app/channels/games_channel.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" ORDER BY "games"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "user_teams" ON "users"."id" = "user_teams"."user_id" WHERE "user_teams"."team_id" = $1 LIMIT $2  [["team_id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."game_id" = $1  [["game_id", 1]]
---
	def subscribed
		user = User.find(params[:user_id])
		game = Game.find(params[:game_id])
		stream_from "games_channel_#{game.id}"

		canChoose = !game.teams.find {|team| !team.users.empty?}