app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", ""], ["created_at", "2018-10-02 19:57:37.297039"], ["updated_at", "2018-10-02 19:57:37.297039"]]
---
  def create
    user = User.new(params[:name])

    if user.save